snlkuharlocal/src/Documents/ЗаявкаНаКоррекциюПланаПродаж/ЗаявкаНаКоррекциюПланаПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаКоррекциюПланаПродаж</name>
  <basedOn>Document.ПланПродаж</basedOn>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Детальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентИзмененияКоличества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаКоррекции</name>
    <type>
      <types>CatalogRef.ПричиныКоррекций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтработалСотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтработки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ПланПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПланаПродаж</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗаписиПланаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>ТипТовара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Брэнд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИсх</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТоварныйЗапас</name>
      <comment>Товарный запас в днях торговли</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазовоеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЗаявкаНаКоррекциюПланаПродаж/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)			
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=Ложь;
		
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;		

	Если Отказ Тогда Возврат КонецЕсли;
		
	Если ЕстьИзменения Тогда 
		ТипТовара			= Брэнд.Родитель;		
		КоличествоДокумента = Состав.Итог("Количество");
		//СуммаДокумента		= Состав.Итог("Всего");
		ГруппыТоваров		= ГруппыТоваровДокумента(ЭтотОбъект,"Состав",?(Детальный,"Номенклатура","Модель"));
		
		Состав.Сортировать("ТипТовара,Брэнд,Модель,Номенклатура");
		
		НужноВыгружать		= Истина;
	Иначе
		Если (НЕ Ссылка.Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение) ИЛИ Ссылка.ПометкаУдаления<>ПометкаУдаления Тогда
			НужноВыгружать=Истина;			
		КонецЕсли;		
	КонецЕсли;	
	
	Если НужноВыгружать Тогда
		//УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если проведен Тогда
		возврат;
	КонецЕсли;	
	
	Для Каждого СтрокаТЧ Из Состав Цикл
		 СтрокаТЧ.Количество = СтрокаТч.КоличествоИсх - строкатч.КоличествоФакт;
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание) экспорт
	
	// если передается обьект, то не отрабатывало..
	// нечаева 19,01,26 ++  https://yougile.collant.ru/team/ab6bad3a05c0/Служба-АСУ#OUT-179
	Если Основание.метаданные().Имя = "ПланПродаж"   Тогда

	//Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПланПродаж") Тогда  // было
		
		Валюта 	= Основание.Валюта;
		ИБ 		= Основание.ИБ;
		Склад 	= Основание.Склад;
		Курс= Основание.курс;
		//	ТипЦен 	= Основание.ТипЦен;
		Подразделение = основание.подразделение;
		ДокОснование = Основание;
		Контрагент =  Основание.контрагент;
		Примечание = основание.примечание;
		детальный = основание.детальный;
		Брэнд = основание.брэнд;
				
		// Нечаева 15,01,26 ++ OUT-179 просто план продаж - учитываем дату запрета.
		//Если Найти("Матрица,ПланПродажПоКлиентам",МетаДок.Имя)<>0  Тогда 
		//Валетов + 28,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8677 Было: 
		//ДатаПланаПродаж = Основание.ДатаПланаПродаж; 
		ДатаПланаПродаж = Основание.ДатаРасчетаЦенПоМатрице;
		// Нечаева 15,01,26 -- OUT-179


		Для Каждого СтрокаИст Из Основание.состав  Цикл
			Если СтрокаИст.Количество=0 Тогда Продолжить КонецЕсли;
			
			СтрокаТЧ=Состав.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаИст);
			СтрокаТЧ.КоличествоИсх = строкаИст.количество;
			//крохин начало 18.02.2021	
			//СтрокаТЧ.Количество=0;
			СтрокаТЧ.КоличествоФакт=СтрокаТЧ.КоличествоИсх;
			СтрокаТЧ.Количество = 0;
			//крохин конец 18.02.2021	
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если утвержден = истина тогда
		сообщить("Отработанный документ нельзя удалять.");
		отказ = истина;	
	конецЕсли;
	
КонецПроцедуры
